FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_mcan.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAMV71_MCAN_COMPONENT_
#define _SAMV71_MCAN_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Controller Area Network */
/* ============================================================================= */
/** \addtogroup SAMV71_MCAN Controller Area Network */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief Mcan hardware registers */
    typedef struct
    {
        __I uint32_t Reserved1[ 2 ];
        __IO uint32_t MCAN_CUST;   /**< \brief (Mcan Offset: 0x08) Customer Register */
        __IO uint32_t MCAN_FBTP;   /**< \brief (Mcan Offset: 0x0C) Fast Bit Timing and Prescaler Register */
        __IO uint32_t MCAN_TEST;   /**< \brief (Mcan Offset: 0x10) Test Register */
        __IO uint32_t MCAN_RWD;    /**< \brief (Mcan Offset: 0x14) RAM Watchdog Register */
        __IO uint32_t MCAN_CCCR;   /**< \brief (Mcan Offset: 0x18) CC Control Register */
        __IO uint32_t MCAN_BTP;    /**< \brief (Mcan Offset: 0x1C) Bit Timing and Prescaler Register */
        __IO uint32_t MCAN_TSCC;   /**< \brief (Mcan Offset: 0x20) Timestamp Counter Configuration Register */
        __IO uint32_t MCAN_TSCV;   /**< \brief (Mcan Offset: 0x24) Timestamp Counter Value Register */
        __IO uint32_t MCAN_TOCC;   /**< \brief (Mcan Offset: 0x28) Timeout Counter Configuration Register */
        __IO uint32_t MCAN_TOCV;   /**< \brief (Mcan Offset: 0x2C) Timeout Counter Value Register */
        __I uint32_t Reserved2[ 4 ];
        __I uint32_t MCAN_ECR;     /**< \brief (Mcan Offset: 0x40) Error Counter Register */
        __I uint32_t MCAN_PSR;     /**< \brief (Mcan Offset: 0x44) Protocol Status Register */
        __I uint32_t Reserved3[ 2 ];
        __IO uint32_t MCAN_IR;     /**< \brief (Mcan Offset: 0x50) Interrupt Register */
        __IO uint32_t MCAN_IE;     /**< \brief (Mcan Offset: 0x54) Interrupt Enable Register */
        __IO uint32_t MCAN_ILS;    /**< \brief (Mcan Offset: 0x58) Interrupt Line Select Register */
        __IO uint32_t MCAN_ILE;    /**< \brief (Mcan Offset: 0x5C) Interrupt Line Enable Register */
        __I uint32_t Reserved4[ 8 ];
        __IO uint32_t MCAN_GFC;    /**< \brief (Mcan Offset: 0x80) Global Filter Configuration Register */
        __IO uint32_t MCAN_SIDFC;  /**< \brief (Mcan Offset: 0x84) Standard ID Filter Configuration Register */
        __IO uint32_t MCAN_XIDFC;  /**< \brief (Mcan Offset: 0x88) Extended ID Filter Configuration Register */
        __I uint32_t Reserved5[ 1 ];
        __IO uint32_t MCAN_XIDAM;  /**< \brief (Mcan Offset: 0x90) Extended ID AND Mask Register */
        __I uint32_t MCAN_HPMS;    /**< \brief (Mcan Offset: 0x94) High Priority Message Status Register */
        __IO uint32_t MCAN_NDAT1;  /**< \brief (Mcan Offset: 0x98) New Data 1 Register */
        __IO uint32_t MCAN_NDAT2;  /**< \brief (Mcan Offset: 0x9C) New Data 2 Register */
        __IO uint32_t MCAN_RXF0C;  /**< \brief (Mcan Offset: 0xA0) Receive FIFO 0 Configuration Register */
        __I uint32_t MCAN_RXF0S;   /**< \brief (Mcan Offset: 0xA4) Receive FIFO 0 Status Register */
        __IO uint32_t MCAN_RXF0A;  /**< \brief (Mcan Offset: 0xA8) Receive FIFO 0 Acknowledge Register */
        __IO uint32_t MCAN_RXBC;   /**< \brief (Mcan Offset: 0xAC) Receive Rx Buffer Configuration Register */
        __IO uint32_t MCAN_RXF1C;  /**< \brief (Mcan Offset: 0xB0) Receive FIFO 1 Configuration Register */
        __I uint32_t MCAN_RXF1S;   /**< \brief (Mcan Offset: 0xB4) Receive FIFO 1 Status Register */
        __IO uint32_t MCAN_RXF1A;  /**< \brief (Mcan Offset: 0xB8) Receive FIFO 1 Acknowledge Register */
        __IO uint32_t MCAN_RXESC;  /**< \brief (Mcan Offset: 0xBC) Receive Buffer / FIFO Element Size Configuration Register */
        __IO uint32_t MCAN_TXBC;   /**< \brief (Mcan Offset: 0xC0) Transmit Buffer Configuration Register */
        __I uint32_t MCAN_TXFQS;   /**< \brief (Mcan Offset: 0xC4) Transmit FIFO/Queue Status Register */
        __IO uint32_t MCAN_TXESC;  /**< \brief (Mcan Offset: 0xC8) Transmit Buffer Element Size Configuration Register */
        __I uint32_t MCAN_TXBRP;   /**< \brief (Mcan Offset: 0xCC) Transmit Buffer Request Pending Register */
        __IO uint32_t MCAN_TXBAR;  /**< \brief (Mcan Offset: 0xD0) Transmit Buffer Add Request Register */
        __IO uint32_t MCAN_TXBCR;  /**< \brief (Mcan Offset: 0xD4) Transmit Buffer Cancellation Request Register */
        __I uint32_t MCAN_TXBTO;   /**< \brief (Mcan Offset: 0xD8) Transmit Buffer Transmission Occurred Register */
        __I uint32_t MCAN_TXBCF;   /**< \brief (Mcan Offset: 0xDC) Transmit Buffer Cancellation Finished Register */
        __IO uint32_t MCAN_TXBTIE; /**< \brief (Mcan Offset: 0xE0) Transmit Buffer Transmission Interrupt Enable Register */
        __IO uint32_t MCAN_TXBCIE; /**< \brief (Mcan Offset: 0xE4) Transmit Buffer Cancellation Finished Interrupt Enable Register */
        __I uint32_t Reserved6[ 2 ];
        __IO uint32_t MCAN_TXEFC;  /**< \brief (Mcan Offset: 0xF0) Transmit Event FIFO Configuration Register */
        __I uint32_t MCAN_TXEFS;   /**< \brief (Mcan Offset: 0xF4) Transmit Event FIFO Status Register */
        __IO uint32_t MCAN_TXEFA;  /**< \brief (Mcan Offset: 0xF8) Transmit Event FIFO Acknowledge Register */
    } Mcan;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- MCAN_CUST : (MCAN Offset: 0x08) Customer Register -------- */
#define MCAN_CUST_CSV_Pos                         0
#define MCAN_CUST_CSV_Msk                         ( 0xffffffffu << MCAN_CUST_CSV_Pos ) /**< \brief (MCAN_CUST) Customer-specific Value */
#define MCAN_CUST_CSV( value )    ( ( MCAN_CUST_CSV_Msk & ( ( value ) << MCAN_CUST_CSV_Pos ) ) )
/* -------- MCAN_FBTP : (MCAN Offset: 0x0C) Fast Bit Timing and Prescaler Register -------- */
#define MCAN_FBTP_FSJW_Pos                        0
#define MCAN_FBTP_FSJW_Msk                        ( 0x3u << MCAN_FBTP_FSJW_Pos ) /**< \brief (MCAN_FBTP) Fast (Re) Synchronization Jump Width */
#define MCAN_FBTP_FSJW( value )      ( ( MCAN_FBTP_FSJW_Msk & ( ( value ) << MCAN_FBTP_FSJW_Pos ) ) )
#define MCAN_FBTP_FTSEG2_Pos                      4
#define MCAN_FBTP_FTSEG2_Msk                      ( 0x7u << MCAN_FBTP_FTSEG2_Pos ) /**< \brief (MCAN_FBTP) Fast Time Segment After Sample Point */
#define MCAN_FBTP_FTSEG2( value )    ( ( MCAN_FBTP_FTSEG2_Msk & ( ( value ) << MCAN_FBTP_FTSEG2_Pos ) ) )
#define MCAN_FBTP_FTSEG1_Pos                      8
#define MCAN_FBTP_FTSEG1_Msk                      ( 0xfu << MCAN_FBTP_FTSEG1_Pos ) /**< \brief (MCAN_FBTP) Fast Time Segment Before Sample Point */
#define MCAN_FBTP_FTSEG1( value )    ( ( MCAN_FBTP_FTSEG1_Msk & ( ( value ) << MCAN_FBTP_FTSEG1_Pos ) ) )
#define MCAN_FBTP_FBRP_Pos                        16
#define MCAN_FBTP_FBRP_Msk                        ( 0x1fu << MCAN_FBTP_FBRP_Pos ) /**< \brief (MCAN_FBTP) Fast Baud Rate Prescaler */
#define MCAN_FBTP_FBRP( value )      ( ( MCAN_FBTP_FBRP_Msk & ( ( value ) << MCAN_FBTP_FBRP_Pos ) ) )
#define MCAN_FBTP_TDC                             ( 0x1u << 23 )                  /**< \brief (MCAN_FBTP) Transceiver Delay Compensation */
#define   MCAN_FBTP_TDC_DISABLED                  ( 0x0u << 23 )                  /**< \brief (MCAN_FBTP) Transceiver Delay Compensation disabled. */
#define   MCAN_FBTP_TDC_ENABLED                   ( 0x1u << 23 )                  /**< \brief (MCAN_FBTP) Transceiver Delay Compensation enabled. */
#define MCAN_FBTP_TDCO_Pos                        24
#define MCAN_FBTP_TDCO_Msk                        ( 0x1fu << MCAN_FBTP_TDCO_Pos ) /**< \brief (MCAN_FBTP) Transce iver Delay Compensation Offset */
#define MCAN_FBTP_TDCO( value )    ( ( MCAN_FBTP_TDCO_Msk & ( ( value ) << MCAN_FBTP_TDCO_Pos ) ) )
/* -------- MCAN_TEST : (MCAN Offset: 0x10) Test Register -------- */
#define MCAN_TEST_LBCK                            ( 0x1u << 4 )                   /**< \brief (MCAN_TEST) Loop Back Mode (read/write) */
#define   MCAN_TEST_LBCK_DISABLED                 ( 0x0u << 4 )                   /**< \brief (MCAN_TEST) Reset value. Loop Back mode is disabled. */
#define   MCAN_TEST_LBCK_ENABLED                  ( 0x1u << 4 )                   /**< \brief (MCAN_TEST) Loop Back mode is enabled (see Section 6.1.9). */
#define MCAN_TEST_TX_Pos                          5
#define MCAN_TEST_TX_Msk                          ( 0x3u << MCAN_TEST_TX_Pos )    /**< \brief (MCAN_TEST) Control of Transmit Pin (read/write) */
#define MCAN_TEST_TX( value )    ( ( MCAN_TEST_TX_Msk & ( ( value ) << MCAN_TEST_TX_Pos ) ) )
#define   MCAN_TEST_TX_RESET                      ( 0x0u << 5 )                   /**< \brief (MCAN_TEST) Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time. */
#define   MCAN_TEST_TX_SAMPLE_POINT_MONITORING    ( 0x1u << 5 )                   /**< \brief (MCAN_TEST) Sample Point can be monitored at pin CANTX. */
#define   MCAN_TEST_TX_DOMINANT                   ( 0x2u << 5 )                   /**< \brief (MCAN_TEST) Dominant ('0') level at pin CANTX. */
#define   MCAN_TEST_TX_RECESSIVE                  ( 0x3u << 5 )                   /**< \brief (MCAN_TEST) Recessive ('1') at pin CANTX. */
#define MCAN_TEST_RX                              ( 0x1u << 7 )                   /**< \brief (MCAN_TEST) Receive Pin (read-only) */
#define MCAN_TEST_TDCV_Pos                        8
#define MCAN_TEST_TDCV_Msk                        ( 0x3fu << MCAN_TEST_TDCV_Pos ) /**< \brief (MCAN_TEST) Transceiver Delay Compensation Value (read-only) */
#define MCAN_TEST_TDCV( value )    ( ( MCAN_TEST_TDCV_Msk & ( ( value ) << MCAN_TEST_TDCV_Pos ) ) )
/* -------- MCAN_RWD : (MCAN Offset: 0x14) RAM Watchdog Register -------- */
#define MCAN_RWD_WDC_Pos                          0
#define MCAN_RWD_WDC_Msk                          ( 0xffu << MCAN_RWD_WDC_Pos ) /**< \brief (MCAN_RWD) Watchdog Configuration (read/write) */
#define MCAN_RWD_WDC( value )    ( ( MCAN_RWD_WDC_Msk & ( ( value ) << MCAN_RWD_WDC_Pos ) ) )
#define MCAN_RWD_WDV_Pos                          8
#define MCAN_RWD_WDV_Msk                          ( 0xffu << MCAN_RWD_WDV_Pos ) /**< \brief (MCAN_RWD) Watchdog Value (read-only) */
#define MCAN_RWD_WDV( value )    ( ( MCAN_RWD_WDV_Msk & ( ( value ) << MCAN_RWD_WDV_Pos ) ) )
/* -------- MCAN_CCCR : (MCAN Offset: 0x18) CC Control Register -------- */
#define MCAN_CCCR_INIT                            ( 0x1u << 0 )                 /**< \brief (MCAN_CCCR) Initialization (read/write) */
#define   MCAN_CCCR_INIT_DISABLED                 ( 0x0u << 0 )                 /**< \brief (MCAN_CCCR) Normal operation. */
#define   MCAN_CCCR_INIT_ENABLED                  ( 0x1u << 0 )                 /**< \brief (MCAN_CCCR) Initialization is started. */
#define MCAN_CCCR_CCE                             ( 0x1u << 1 )                 /**< \brief (MCAN_CCCR) Configuration Change Enable (read/write, write protection) */
#define   MCAN_CCCR_CCE_PROTECTED                 ( 0x0u << 1 )                 /**< \brief (MCAN_CCCR) The processor has no write access to the protected configuration registers. */
#define   MCAN_CCCR_CCE_CONFIGURABLE              ( 0x1u << 1 )                 /**< \brief (MCAN_CCCR) The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1'). */
#define MCAN_CCCR_ASM                             ( 0x1u << 2 )                 /**< \brief (MCAN_CCCR) Restricted Operation Mode (read/write, write protection against '1') */
#define   MCAN_CCCR_ASM_NORMAL                    ( 0x0u << 2 )                 /**< \brief (MCAN_CCCR) Normal CAN operation. */
#define   MCAN_CCCR_ASM_RESTRICTED                ( 0x1u << 2 )                 /**< \brief (MCAN_CCCR) Restricted operation mode active. */
#define MCAN_CCCR_CSA                             ( 0x1u << 3 )                 /**< \brief (MCAN_CCCR) Clock Stop Acknowledge (read-only) */
#define MCAN_CCCR_CSR                             ( 0x1u << 4 )                 /**< \brief (MCAN_CCCR) Clock Stop Request (read/write) */
#define   MCAN_CCCR_CSR_NO_CLOCK_STOP             ( 0x0u << 4 )                 /**< \brief (MCAN_CCCR) No clock stop is requested. */
#define   MCAN_CCCR_CSR_CLOCK_STOP                ( 0x1u << 4 )                 /**< \brief (MCAN_CCCR) Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle. */
#define MCAN_CCCR_MON                             ( 0x1u << 5 )                 /**< \brief (MCAN_CCCR) Bus Monitoring Mode (read/write, write protection against '1') */
#define   MCAN_CCCR_MON_DISABLED                  ( 0x0u << 5 )                 /**< \brief (MCAN_CCCR) Bus Monitoring mode is disabled. */
#define   MCAN_CCCR_MON_ENABLED                   ( 0x1u << 5 )                 /**< \brief (MCAN_CCCR) Bus Monitoring mode is enabled. */
#define MCAN_CCCR_DAR                             ( 0x1u << 6 )                 /**< \brief (MCAN_CCCR) Disable Automatic Retransmission (read/write, write protection) */
#define   MCAN_CCCR_DAR_AUTO_RETX                 ( 0x0u << 6 )                 /**< \brief (MCAN_CCCR) Automatic retransmission of messages not transmitted successfully enabled. */
#define   MCAN_CCCR_DAR_NO_AUTO_RETX              ( 0x1u << 6 )                 /**< \brief (MCAN_CCCR) Automatic retransmission disabled. */
#define MCAN_CCCR_TEST                            ( 0x1u << 7 )                 /**< \brief (MCAN_CCCR) Test Mode Enable (read/write, write protection against '1') */
#define   MCAN_CCCR_TEST_DISABLED                 ( 0x0u << 7 )                 /**< \brief (MCAN_CCCR) Normal operation, MCAN_TEST register holds reset values. */
#define   MCAN_CCCR_TEST_ENABLED                  ( 0x1u << 7 )                 /**< \brief (MCAN_CCCR) Test mode, write access to MCAN_TEST register enabled. */
#define MCAN_CCCR_CME_Pos                         8
#define MCAN_CCCR_CME_Msk                         ( 0x3u << MCAN_CCCR_CME_Pos ) /**< \brief (MCAN_CCCR) CAN Mode Enable (read/write, write protection) */
#define MCAN_CCCR_CME( value )    ( ( MCAN_CCCR_CME_Msk & ( ( value ) << MCAN_CCCR_CME_Pos ) ) )
#define   MCAN_CCCR_CME_ISO11898_1                ( 0x0u << 8 )                 /**< \brief (MCAN_CCCR) CAN operation according to ISO11898-1 enabled */
#define   MCAN_CCCR_CME_FD                        ( 0x1u << 8 )                 /**< \brief (MCAN_CCCR) CAN FD operation enabled */
#define MCAN_CCCR_CMR_Pos                         10
#define MCAN_CCCR_CMR_Msk                         ( 0x3u << MCAN_CCCR_CMR_Pos ) /**< \brief (MCAN_CCCR) CAN Mode Request (read/write) */
#define MCAN_CCCR_CMR( value )    ( ( MCAN_CCCR_CMR_Msk & ( ( value ) << MCAN_CCCR_CMR_Pos ) ) )
#define   MCAN_CCCR_CMR_NO_CHANGE                 ( 0x0u << 10 )                /**< \brief (MCAN_CCCR) No mode change */
#define   MCAN_CCCR_CMR_FD                        ( 0x1u << 10 )                /**< \brief (MCAN_CCCR) Request CAN FD operation */
#define   MCAN_CCCR_CMR_FD_BITRATE_SWITCH         ( 0x2u << 10 )                /**< \brief (MCAN_CCCR) Request CAN FD operation with bit rate switching */
#define   MCAN_CCCR_CMR_ISO11898_1                ( 0x3u << 10 )                /**< \brief (MCAN_CCCR) Request CAN operation according ISO11898-1 */
#define MCAN_CCCR_FDO                             ( 0x1u << 12 )                /**< \brief (MCAN_CCCR) CAN FD Operation (read-only) */
#define MCAN_CCCR_FDBS                            ( 0x1u << 13 )                /**< \brief (MCAN_CCCR) CAN FD Bit Rate Switching (read-only) */
#define MCAN_CCCR_TXP                             ( 0x1u << 14 )                /**< \brief (MCAN_CCCR) Transmit Pause (read/write, write protection) */
/* -------- MCAN_BTP : (MCAN Offset: 0x1C) Bit Timing and Prescaler Register -------- */
#define MCAN_BTP_SJW_Pos                          0
#define MCAN_BTP_SJW_Msk                          ( 0xfu << MCAN_BTP_SJW_Pos ) /**< \brief (MCAN_BTP) (Re) Synchronization Jump Width */
#define MCAN_BTP_SJW( value )      ( ( MCAN_BTP_SJW_Msk & ( ( value ) << MCAN_BTP_SJW_Pos ) ) )
#define MCAN_BTP_TSEG2_Pos                        4
#define MCAN_BTP_TSEG2_Msk                        ( 0xfu << MCAN_BTP_TSEG2_Pos ) /**< \brief (MCAN_BTP) Time Segment After Sample Point */
#define MCAN_BTP_TSEG2( value )    ( ( MCAN_BTP_TSEG2_Msk & ( ( value ) << MCAN_BTP_TSEG2_Pos ) ) )
#define MCAN_BTP_TSEG1_Pos                        8
#define MCAN_BTP_TSEG1_Msk                        ( 0x3fu << MCAN_BTP_TSEG1_Pos ) /**< \brief (MCAN_BTP) Time Segment Before Sample Point */
#define MCAN_BTP_TSEG1( value )    ( ( MCAN_BTP_TSEG1_Msk & ( ( value ) << MCAN_BTP_TSEG1_Pos ) ) )
#define MCAN_BTP_BRP_Pos                          16
#define MCAN_BTP_BRP_Msk                          ( 0x3ffu << MCAN_BTP_BRP_Pos ) /**< \brief (MCAN_BTP) Baud Rate Prescaler */
#define MCAN_BTP_BRP( value )      ( ( MCAN_BTP_BRP_Msk & ( ( value ) << MCAN_BTP_BRP_Pos ) ) )
/* -------- MCAN_TSCC : (MCAN Offset: 0x20) Timestamp Counter Configuration Register -------- */
#define MCAN_TSCC_TSS_Pos                         0
#define MCAN_TSCC_TSS_Msk                         ( 0x3u << MCAN_TSCC_TSS_Pos ) /**< \brief (MCAN_TSCC) Timestamp Select */
#define MCAN_TSCC_TSS( value )    ( ( MCAN_TSCC_TSS_Msk & ( ( value ) << MCAN_TSCC_TSS_Pos ) ) )
#define   MCAN_TSCC_TSS_ALWAYS_0                  ( 0x0u << 0 )                 /**< \brief (MCAN_TSCC) Timestamp counter value always 0x0000 */
#define   MCAN_TSCC_TSS_TCP_INC                   ( 0x1u << 0 )                 /**< \brief (MCAN_TSCC) Timestamp counter value incremented according to TCP */
#define   MCAN_TSCC_TSS_EXT_TIMESTAMP             ( 0x2u << 0 )                 /**< \brief (MCAN_TSCC) External timestamp counter value used */
#define MCAN_TSCC_TCP_Pos                         16
#define MCAN_TSCC_TCP_Msk                         ( 0xfu << MCAN_TSCC_TCP_Pos ) /**< \brief (MCAN_TSCC) Timestamp Counter Prescaler */
#define MCAN_TSCC_TCP( value )    ( ( MCAN_TSCC_TCP_Msk & ( ( value ) << MCAN_TSCC_TCP_Pos ) ) )
/* -------- MCAN_TSCV : (MCAN Offset: 0x24) Timestamp Counter Value Register -------- */
#define MCAN_TSCV_TSC_Pos                         0
#define MCAN_TSCV_TSC_Msk                         ( 0xffffu << MCAN_TSCV_TSC_Pos ) /**< \brief (MCAN_TSCV) Timestamp Counter (cleared on write) */
#define MCAN_TSCV_TSC( value )    ( ( MCAN_TSCV_TSC_Msk & ( ( value ) << MCAN_TSCV_TSC_Pos ) ) )
/* -------- MCAN_TOCC : (MCAN Offset: 0x28) Timeout Counter Configuration Register -------- */
#define MCAN_TOCC_ETOC                            ( 0x1u << 0 )                    /**< \brief (MCAN_TOCC) Enable Timeout Counter */
#define   MCAN_TOCC_ETOC_NO_TIMEOUT               ( 0x0u << 0 )                    /**< \brief (MCAN_TOCC) Timeout Counter disabled. */
#define   MCAN_TOCC_ETOC_TOS_CONTROLLED           ( 0x1u << 0 )                    /**< \brief (MCAN_TOCC) Timeout Counter enabled. */
#define MCAN_TOCC_TOS_Pos                         1
#define MCAN_TOCC_TOS_Msk                         ( 0x3u << MCAN_TOCC_TOS_Pos )    /**< \brief (MCAN_TOCC) Timeout Select */
#define MCAN_TOCC_TOS( value )    ( ( MCAN_TOCC_TOS_Msk & ( ( value ) << MCAN_TOCC_TOS_Pos ) ) )
#define   MCAN_TOCC_TOS_CONTINUOUS                ( 0x0u << 1 )                    /**< \brief (MCAN_TOCC) Continuous operation */
#define   MCAN_TOCC_TOS_TX_EV_TIMEOUT             ( 0x1u << 1 )                    /**< \brief (MCAN_TOCC) Timeout controlled by Tx Event FIFO */
#define   MCAN_TOCC_TOS_RX0_EV_TIMEOUT            ( 0x2u << 1 )                    /**< \brief (MCAN_TOCC) Timeout controlled by Receive FIFO 0 */
#define   MCAN_TOCC_TOS_RX1_EV_TIMEOUT            ( 0x3u << 1 )                    /**< \brief (MCAN_TOCC) Timeout controlled by Receive FIFO 1 */
#define MCAN_TOCC_TOP_Pos                         16
#define MCAN_TOCC_TOP_Msk                         ( 0xffffu << MCAN_TOCC_TOP_Pos ) /**< \brief (MCAN_TOCC) Timeout Period */
#define MCAN_TOCC_TOP( value )    ( ( MCAN_TOCC_TOP_Msk & ( ( value ) << MCAN_TOCC_TOP_Pos ) ) )
/* -------- MCAN_TOCV : (MCAN Offset: 0x2C) Timeout Counter Value Register -------- */
#define MCAN_TOCV_TOC_Pos                         0
#define MCAN_TOCV_TOC_Msk                         ( 0xffffu << MCAN_TOCV_TOC_Pos ) /**< \brief (MCAN_TOCV) Timeout Counter (cleared on write) */
#define MCAN_TOCV_TOC( value )    ( ( MCAN_TOCV_TOC_Msk & ( ( value ) << MCAN_TOCV_TOC_Pos ) ) )
/* -------- MCAN_ECR : (MCAN Offset: 0x40) Error Counter Register -------- */
#define MCAN_ECR_TEC_Pos                          0
#define MCAN_ECR_TEC_Msk                          ( 0xffu << MCAN_ECR_TEC_Pos ) /**< \brief (MCAN_ECR) Transmit Error Counter */
#define MCAN_ECR_REC_Pos                          8
#define MCAN_ECR_REC_Msk                          ( 0x7fu << MCAN_ECR_REC_Pos ) /**< \brief (MCAN_ECR) Receive Error Counter */
#define MCAN_ECR_RP                               ( 0x1u << 15 )                /**< \brief (MCAN_ECR) Receive Error Passive */
#define MCAN_ECR_CEL_Pos                          16
#define MCAN_ECR_CEL_Msk                          ( 0xffu << MCAN_ECR_CEL_Pos ) /**< \brief (MCAN_ECR) CAN Error Logging (cleared on read) */
/* -------- MCAN_PSR : (MCAN Offset: 0x44) Protocol Status Register -------- */
#define MCAN_PSR_LEC_Pos                          0
#define MCAN_PSR_LEC_Msk                          ( 0x7u << MCAN_PSR_LEC_Pos )  /**< \brief (MCAN_PSR) Last Error Code (set to 111 on read) */
