FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_mcan.h
#define   MCAN_PSR_LEC_NO_ERROR                   ( 0x0u << 0 )                 /**< \brief (MCAN_PSR) No error occurred since LEC has been reset by successful reception or transmission. */
#define   MCAN_PSR_LEC_STUFF_ERROR                ( 0x1u << 0 )                 /**< \brief (MCAN_PSR) More than 5 equal bits in a sequence have occurred in a part of a received meSsage where this is not allowed. */
#define   MCAN_PSR_LEC_FORM_ERROR                 ( 0x2u << 0 )                 /**< \brief (MCAN_PSR) A fixed format part of a received frame has the wrong format. */
#define   MCAN_PSR_LEC_ACK_ERROR                  ( 0x3u << 0 )                 /**< \brief (MCAN_PSR) The message transmitted by the MCAN was not acknowledged by another node. */
#define   MCAN_PSR_LEC_BIT1_ERROR                 ( 0x4u << 0 )                 /**< \brief (MCAN_PSR) During the transmission of a message (with the exception of the arbitration field), the device wanted to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant. */
#define   MCAN_PSR_LEC_BIT0_ERROR                 ( 0x5u << 0 )                 /**< \brief (MCAN_PSR) During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed). */
#define   MCAN_PSR_LEC_CRC_ERROR                  ( 0x6u << 0 )                 /**< \brief (MCAN_PSR) The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data. */
#define   MCAN_PSR_LEC_NO_CHANGE                  ( 0x7u << 0 )                 /**< \brief (MCAN_PSR) Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows the value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register. */
#define MCAN_PSR_ACT_Pos                          3
#define MCAN_PSR_ACT_Msk                          ( 0x3u << MCAN_PSR_ACT_Pos )  /**< \brief (MCAN_PSR) Activity */
#define   MCAN_PSR_ACT_SYNCHRONIZING              ( 0x0u << 3 )                 /**< \brief (MCAN_PSR) Node is synchronizing on CAN communication */
#define   MCAN_PSR_ACT_IDLE                       ( 0x1u << 3 )                 /**< \brief (MCAN_PSR) Node is neither receiver nor transmitter */
#define   MCAN_PSR_ACT_RECEIVER                   ( 0x2u << 3 )                 /**< \brief (MCAN_PSR) Node is operating as receiver */
#define   MCAN_PSR_ACT_TRANSMITTER                ( 0x3u << 3 )                 /**< \brief (MCAN_PSR) Node is operating as transmitter */
#define MCAN_PSR_EP                               ( 0x1u << 5 )                 /**< \brief (MCAN_PSR) Error Passive */
#define MCAN_PSR_EW                               ( 0x1u << 6 )                 /**< \brief (MCAN_PSR) Warning Status */
#define MCAN_PSR_BO                               ( 0x1u << 7 )                 /**< \brief (MCAN_PSR) Bus_Off Status */
#define MCAN_PSR_FLEC_Pos                         8
#define MCAN_PSR_FLEC_Msk                         ( 0x7u << MCAN_PSR_FLEC_Pos ) /**< \brief (MCAN_PSR) Fast Last Error Code (set to 111 on read) */
#define MCAN_PSR_RESI                             ( 0x1u << 11 )                /**< \brief (MCAN_PSR) ESI Flag of Last Received CAN FD Message (cleared on read) */
#define MCAN_PSR_RBRS                             ( 0x1u << 12 )                /**< \brief (MCAN_PSR) BRS Flag of Last Received CAN FD Message (cleared on read) */
#define MCAN_PSR_REDL                             ( 0x1u << 13 )                /**< \brief (MCAN_PSR) Received a CAN FD Message (cleared on read) */
/* -------- MCAN_IR : (MCAN Offset: 0x50) Interrupt Register -------- */
#define MCAN_IR_RF0N                              ( 0x1u << 0 )                 /**< \brief (MCAN_IR) Receive FIFO 0 New Message */
#define MCAN_IR_RF0W                              ( 0x1u << 1 )                 /**< \brief (MCAN_IR) Receive FIFO 0 Watermark Reached */
#define MCAN_IR_RF0F                              ( 0x1u << 2 )                 /**< \brief (MCAN_IR) Receive FIFO 0 Full */
#define MCAN_IR_RF0L                              ( 0x1u << 3 )                 /**< \brief (MCAN_IR) Receive FIFO 0 Message Lost */
#define MCAN_IR_RF1N                              ( 0x1u << 4 )                 /**< \brief (MCAN_IR) Receive FIFO 1 New Message */
#define MCAN_IR_RF1W                              ( 0x1u << 5 )                 /**< \brief (MCAN_IR) Receive FIFO 1 Watermark Reached */
#define MCAN_IR_RF1F                              ( 0x1u << 6 )                 /**< \brief (MCAN_IR) Receive FIFO 1 Full */
#define MCAN_IR_RF1L                              ( 0x1u << 7 )                 /**< \brief (MCAN_IR) Receive FIFO 1 Message Lost */
#define MCAN_IR_HPM                               ( 0x1u << 8 )                 /**< \brief (MCAN_IR) High Priority Message */
#define MCAN_IR_TC                                ( 0x1u << 9 )                 /**< \brief (MCAN_IR) Transmission Completed */
#define MCAN_IR_TCF                               ( 0x1u << 10 )                /**< \brief (MCAN_IR) Transmission Cancellation Finished */
#define MCAN_IR_TFE                               ( 0x1u << 11 )                /**< \brief (MCAN_IR) Tx FIFO Empty */
#define MCAN_IR_TEFN                              ( 0x1u << 12 )                /**< \brief (MCAN_IR) Tx Event FIFO New Entry */
#define MCAN_IR_TEFW                              ( 0x1u << 13 )                /**< \brief (MCAN_IR) Tx Event FIFO Watermark Reached */
#define MCAN_IR_TEFF                              ( 0x1u << 14 )                /**< \brief (MCAN_IR) Tx Event FIFO Full */
#define MCAN_IR_TEFL                              ( 0x1u << 15 )                /**< \brief (MCAN_IR) Tx Event FIFO Element Lost */
#define MCAN_IR_TSW                               ( 0x1u << 16 )                /**< \brief (MCAN_IR) Timestamp Wraparound */
#define MCAN_IR_MRAF                              ( 0x1u << 17 )                /**< \brief (MCAN_IR) Message RAM Access Failure */
#define MCAN_IR_TOO                               ( 0x1u << 18 )                /**< \brief (MCAN_IR) Timeout Occurred */
#define MCAN_IR_DRX                               ( 0x1u << 19 )                /**< \brief (MCAN_IR) Message stored to Dedicated Receive Buffer */
#define MCAN_IR_ELO                               ( 0x1u << 22 )                /**< \brief (MCAN_IR) Error Logging Overflow */
#define MCAN_IR_EP                                ( 0x1u << 23 )                /**< \brief (MCAN_IR) Error Passive */
#define MCAN_IR_EW                                ( 0x1u << 24 )                /**< \brief (MCAN_IR) Warning Status */
#define MCAN_IR_BO                                ( 0x1u << 25 )                /**< \brief (MCAN_IR) Bus_Off Status */
#define MCAN_IR_WDI                               ( 0x1u << 26 )                /**< \brief (MCAN_IR) Watchdog Interrupt */
#define MCAN_IR_CRCE                              ( 0x1u << 27 )                /**< \brief (MCAN_IR) CRC Error */
#define MCAN_IR_BE                                ( 0x1u << 28 )                /**< \brief (MCAN_IR) Bit Error */
#define MCAN_IR_ACKE                              ( 0x1u << 29 )                /**< \brief (MCAN_IR) Acknowledge Error */
#define MCAN_IR_FOE                               ( 0x1u << 30 )                /**< \brief (MCAN_IR) Format Error */
#define MCAN_IR_STE                               ( 0x1u << 31 )                /**< \brief (MCAN_IR) Stuff Error */
/* -------- MCAN_IE : (MCAN Offset: 0x54) Interrupt Enable Register -------- */
#define MCAN_IE_RF0NE                             ( 0x1u << 0 )                 /**< \brief (MCAN_IE) Receive FIFO 0 New Message Interrupt Enable */
#define MCAN_IE_RF0WE                             ( 0x1u << 1 )                 /**< \brief (MCAN_IE) Receive FIFO 0 Watermark Reached Interrupt Enable */
#define MCAN_IE_RF0FE                             ( 0x1u << 2 )                 /**< \brief (MCAN_IE) Receive FIFO 0 Full Interrupt Enable */
#define MCAN_IE_RF0LE                             ( 0x1u << 3 )                 /**< \brief (MCAN_IE) Receive FIFO 0 Message Lost Interrupt Enable */
#define MCAN_IE_RF1NE                             ( 0x1u << 4 )                 /**< \brief (MCAN_IE) Receive FIFO 1 New Message Interrupt Enable */
#define MCAN_IE_RF1WE                             ( 0x1u << 5 )                 /**< \brief (MCAN_IE) Receive FIFO 1 Watermark Reached Interrupt Enable */
#define MCAN_IE_RF1FE                             ( 0x1u << 6 )                 /**< \brief (MCAN_IE) Receive FIFO 1 Full Interrupt Enable */
#define MCAN_IE_RF1LE                             ( 0x1u << 7 )                 /**< \brief (MCAN_IE) Receive FIFO 1 Message Lost Interrupt Enable */
#define MCAN_IE_HPME                              ( 0x1u << 8 )                 /**< \brief (MCAN_IE) High Priority Message Interrupt Enable */
#define MCAN_IE_TCE                               ( 0x1u << 9 )                 /**< \brief (MCAN_IE) Transmission Completed Interrupt Enable */
#define MCAN_IE_TCFE                              ( 0x1u << 10 )                /**< \brief (MCAN_IE) Transmission Cancellation Finished Interrupt Enable */
#define MCAN_IE_TFEE                              ( 0x1u << 11 )                /**< \brief (MCAN_IE) Tx FIFO Empty Interrupt Enable */
#define MCAN_IE_TEFNE                             ( 0x1u << 12 )                /**< \brief (MCAN_IE) Tx Event FIFO New Entry Interrupt Enable */
#define MCAN_IE_TEFWE                             ( 0x1u << 13 )                /**< \brief (MCAN_IE) Tx Event FIFO Watermark Reached Interrupt Enable */
#define MCAN_IE_TEFFE                             ( 0x1u << 14 )                /**< \brief (MCAN_IE) Tx Event FIFO Full Interrupt Enable */
#define MCAN_IE_TEFLE                             ( 0x1u << 15 )                /**< \brief (MCAN_IE) Tx Event FIFO Event Lost Interrupt Enable */
#define MCAN_IE_TSWE                              ( 0x1u << 16 )                /**< \brief (MCAN_IE) Timestamp Wraparound Interrupt Enable */
#define MCAN_IE_MRAFE                             ( 0x1u << 17 )                /**< \brief (MCAN_IE) Message RAM Access Failure Interrupt Enable */
#define MCAN_IE_TOOE                              ( 0x1u << 18 )                /**< \brief (MCAN_IE) Timeout Occurred Interrupt Enable */
#define MCAN_IE_DRXE                              ( 0x1u << 19 )                /**< \brief (MCAN_IE) Message stored to Dedicated Receive Buffer Interrupt Enable */
#define MCAN_IE_ELOE                              ( 0x1u << 22 )                /**< \brief (MCAN_IE) Error Logging Overflow Interrupt Enable */
#define MCAN_IE_EPE                               ( 0x1u << 23 )                /**< \brief (MCAN_IE) Error Passive Interrupt Enable */
#define MCAN_IE_EWE                               ( 0x1u << 24 )                /**< \brief (MCAN_IE) Warning Status Interrupt Enable */
#define MCAN_IE_BOE                               ( 0x1u << 25 )                /**< \brief (MCAN_IE) Bus_Off Status Interrupt Enable */
#define MCAN_IE_WDIE                              ( 0x1u << 26 )                /**< \brief (MCAN_IE) Watchdog Interrupt Enable */
#define MCAN_IE_CRCEE                             ( 0x1u << 27 )                /**< \brief (MCAN_IE) CRC Error Interrupt Enable */
#define MCAN_IE_BEE                               ( 0x1u << 28 )                /**< \brief (MCAN_IE) Bit Error Interrupt Enable */
#define MCAN_IE_ACKEE                             ( 0x1u << 29 )                /**< \brief (MCAN_IE) Acknowledge Error Interrupt Enable */
#define MCAN_IE_FOEE                              ( 0x1u << 30 )                /**< \brief (MCAN_IE) Format Error Interrupt Enable */
#define MCAN_IE_STEE                              ( 0x1u << 31 )                /**< \brief (MCAN_IE) Stuff Error Interrupt Enable */
/* -------- MCAN_ILS : (MCAN Offset: 0x58) Interrupt Line Select Register -------- */
#define MCAN_ILS_RF0NL                            ( 0x1u << 0 )                 /**< \brief (MCAN_ILS) Receive FIFO 0 New Message Interrupt Line */
#define MCAN_ILS_RF0WL                            ( 0x1u << 1 )                 /**< \brief (MCAN_ILS) Receive FIFO 0 Watermark Reached Interrupt Line */
#define MCAN_ILS_RF0FL                            ( 0x1u << 2 )                 /**< \brief (MCAN_ILS) Receive FIFO 0 Full Interrupt Line */
#define MCAN_ILS_RF0LL                            ( 0x1u << 3 )                 /**< \brief (MCAN_ILS) Receive FIFO 0 Message Lost Interrupt Line */
#define MCAN_ILS_RF1NL                            ( 0x1u << 4 )                 /**< \brief (MCAN_ILS) Receive FIFO 1 New Message Interrupt Line */
#define MCAN_ILS_RF1WL                            ( 0x1u << 5 )                 /**< \brief (MCAN_ILS) Receive FIFO 1 Watermark Reached Interrupt Line */
#define MCAN_ILS_RF1FL                            ( 0x1u << 6 )                 /**< \brief (MCAN_ILS) Receive FIFO 1 Full Interrupt Line */
#define MCAN_ILS_RF1LL                            ( 0x1u << 7 )                 /**< \brief (MCAN_ILS) Receive FIFO 1 Message Lost Interrupt Line */
#define MCAN_ILS_HPML                             ( 0x1u << 8 )                 /**< \brief (MCAN_ILS) High Priority Message Interrupt Line */
#define MCAN_ILS_TCL                              ( 0x1u << 9 )                 /**< \brief (MCAN_ILS) Transmission Completed Interrupt Line */
#define MCAN_ILS_TCFL                             ( 0x1u << 10 )                /**< \brief (MCAN_ILS) Transmission Cancellation Finished Interrupt Line */
#define MCAN_ILS_TFEL                             ( 0x1u << 11 )                /**< \brief (MCAN_ILS) Tx FIFO Empty Interrupt Line */
#define MCAN_ILS_TEFNL                            ( 0x1u << 12 )                /**< \brief (MCAN_ILS) Tx Event FIFO New Entry Interrupt Line */
#define MCAN_ILS_TEFWL                            ( 0x1u << 13 )                /**< \brief (MCAN_ILS) Tx Event FIFO Watermark Reached Interrupt Line */
#define MCAN_ILS_TEFFL                            ( 0x1u << 14 )                /**< \brief (MCAN_ILS) Tx Event FIFO Full Interrupt Line */
#define MCAN_ILS_TEFLL                            ( 0x1u << 15 )                /**< \brief (MCAN_ILS) Tx Event FIFO Event Lost Interrupt Line */
#define MCAN_ILS_TSWL                             ( 0x1u << 16 )                /**< \brief (MCAN_ILS) Timestamp Wraparound Interrupt Line */
#define MCAN_ILS_MRAFL                            ( 0x1u << 17 )                /**< \brief (MCAN_ILS) Message RAM Access Failure Interrupt Line */
#define MCAN_ILS_TOOL                             ( 0x1u << 18 )                /**< \brief (MCAN_ILS) Timeout Occurred Interrupt Line */
#define MCAN_ILS_DRXL                             ( 0x1u << 19 )                /**< \brief (MCAN_ILS) Message stored to Dedicated Receive Buffer Interrupt Line */
#define MCAN_ILS_ELOL                             ( 0x1u << 22 )                /**< \brief (MCAN_ILS) Error Logging Overflow Interrupt Line */
#define MCAN_ILS_EPL                              ( 0x1u << 23 )                /**< \brief (MCAN_ILS) Error Passive Interrupt Line */
#define MCAN_ILS_EWL                              ( 0x1u << 24 )                /**< \brief (MCAN_ILS) Warning Status Interrupt Line */
#define MCAN_ILS_BOL                              ( 0x1u << 25 )                /**< \brief (MCAN_ILS) Bus_Off Status Interrupt Line */
#define MCAN_ILS_WDIL                             ( 0x1u << 26 )                /**< \brief (MCAN_ILS) Watchdog Interrupt Line */
#define MCAN_ILS_CRCEL                            ( 0x1u << 27 )                /**< \brief (MCAN_ILS) CRC Error Interrupt Line */
#define MCAN_ILS_BEL                              ( 0x1u << 28 )                /**< \brief (MCAN_ILS) Bit Error Interrupt Line */
#define MCAN_ILS_ACKEL                            ( 0x1u << 29 )                /**< \brief (MCAN_ILS) Acknowledge Error Interrupt Line */
#define MCAN_ILS_FOEL                             ( 0x1u << 30 )                /**< \brief (MCAN_ILS) Format Error Interrupt Line */
#define MCAN_ILS_STEL                             ( 0x1u << 31 )                /**< \brief (MCAN_ILS) Stuff Error Interrupt Line */
/* -------- MCAN_ILE : (MCAN Offset: 0x5C) Interrupt Line Enable Register -------- */
#define MCAN_ILE_EINT0                            ( 0x1u << 0 )                 /**< \brief (MCAN_ILE) Enable Interrupt Line 0 */
#define MCAN_ILE_EINT1                            ( 0x1u << 1 )                 /**< \brief (MCAN_ILE) Enable Interrupt Line 1 */
/* -------- MCAN_GFC : (MCAN Offset: 0x80) Global Filter Configuration Register -------- */
#define MCAN_GFC_RRFE                             ( 0x1u << 0 )                 /**< \brief (MCAN_GFC) Reject Remote Frames Extended */
#define   MCAN_GFC_RRFE_FILTER                    ( 0x0u << 0 )                 /**< \brief (MCAN_GFC) Filter remote frames with 29-bit extended IDs. */
#define   MCAN_GFC_RRFE_REJECT                    ( 0x1u << 0 )                 /**< \brief (MCAN_GFC) Reject all remote frames with 29-bit extended IDs. */
#define MCAN_GFC_RRFS                             ( 0x1u << 1 )                 /**< \brief (MCAN_GFC) Reject Remote Frames Standard */
#define   MCAN_GFC_RRFS_FILTER                    ( 0x0u << 1 )                 /**< \brief (MCAN_GFC) Filter remote frames with 11-bit standard IDs. */
#define   MCAN_GFC_RRFS_REJECT                    ( 0x1u << 1 )                 /**< \brief (MCAN_GFC) Reject all remote frames with 11-bit standard IDs. */
#define MCAN_GFC_ANFE_Pos                         2
#define MCAN_GFC_ANFE_Msk                         ( 0x3u << MCAN_GFC_ANFE_Pos ) /**< \brief (MCAN_GFC) Accept Non-matching Frames Extended */
#define MCAN_GFC_ANFE( value )    ( ( MCAN_GFC_ANFE_Msk & ( ( value ) << MCAN_GFC_ANFE_Pos ) ) )
#define   MCAN_GFC_ANFE_RX_FIFO_0                 ( 0x0u << 2 )                 /**< \brief (MCAN_GFC) Message stored in Receive FIFO 0 */
#define   MCAN_GFC_ANFE_RX_FIFO_1                 ( 0x1u << 2 )                 /**< \brief (MCAN_GFC) Message stored in Receive FIFO 1 */
#define MCAN_GFC_ANFS_Pos                         4
#define MCAN_GFC_ANFS_Msk                         ( 0x3u << MCAN_GFC_ANFS_Pos ) /**< \brief (MCAN_GFC) Accept Non-matching Frames Standard */
#define MCAN_GFC_ANFS( value )    ( ( MCAN_GFC_ANFS_Msk & ( ( value ) << MCAN_GFC_ANFS_Pos ) ) )
#define   MCAN_GFC_ANFS_RX_FIFO_0                 ( 0x0u << 4 )                 /**< \brief (MCAN_GFC) Message stored in Receive FIFO 0 */
#define   MCAN_GFC_ANFS_RX_FIFO_1                 ( 0x1u << 4 )                 /**< \brief (MCAN_GFC) Message stored in Receive FIFO 1 */
/* -------- MCAN_SIDFC : (MCAN Offset: 0x84) Standard ID Filter Configuration Register -------- */
#define MCAN_SIDFC_FLSSA_Pos                      2
#define MCAN_SIDFC_FLSSA_Msk                      ( 0x3fffu << MCAN_SIDFC_FLSSA_Pos ) /**< \brief (MCAN_SIDFC) Filter List Standard Start Address */
#define MCAN_SIDFC_FLSSA( value )    ( ( MCAN_SIDFC_FLSSA_Msk & ( ( value ) << MCAN_SIDFC_FLSSA_Pos ) ) )
#define MCAN_SIDFC_LSS_Pos                        16
#define MCAN_SIDFC_LSS_Msk                        ( 0xffu << MCAN_SIDFC_LSS_Pos ) /**< \brief (MCAN_SIDFC) List Size Standard */
#define MCAN_SIDFC_LSS( value )      ( ( MCAN_SIDFC_LSS_Msk & ( ( value ) << MCAN_SIDFC_LSS_Pos ) ) )
/* -------- MCAN_XIDFC : (MCAN Offset: 0x88) Extended ID Filter Configuration Register -------- */
#define MCAN_XIDFC_FLESA_Pos                      2
#define MCAN_XIDFC_FLESA_Msk                      ( 0x3fffu << MCAN_XIDFC_FLESA_Pos ) /**< \brief (MCAN_XIDFC) Filter List Extended Start Address */
#define MCAN_XIDFC_FLESA( value )    ( ( MCAN_XIDFC_FLESA_Msk & ( ( value ) << MCAN_XIDFC_FLESA_Pos ) ) )
#define MCAN_XIDFC_LSE_Pos                        16
#define MCAN_XIDFC_LSE_Msk                        ( 0x7fu << MCAN_XIDFC_LSE_Pos ) /**< \brief (MCAN_XIDFC) List Size Extended */
#define MCAN_XIDFC_LSE( value )      ( ( MCAN_XIDFC_LSE_Msk & ( ( value ) << MCAN_XIDFC_LSE_Pos ) ) )
/* -------- MCAN_XIDAM : (MCAN Offset: 0x90) Extended ID AND Mask Register -------- */
#define MCAN_XIDAM_EIDM_Pos                       0
#define MCAN_XIDAM_EIDM_Msk                       ( 0x1fffffffu << MCAN_XIDAM_EIDM_Pos ) /**< \brief (MCAN_XIDAM) Extended ID Mask */
#define MCAN_XIDAM_EIDM( value )    ( ( MCAN_XIDAM_EIDM_Msk & ( ( value ) << MCAN_XIDAM_EIDM_Pos ) ) )
/* -------- MCAN_HPMS : (MCAN Offset: 0x94) High Priority Message Status Register -------- */
#define MCAN_HPMS_BIDX_Pos                        0
#define MCAN_HPMS_BIDX_Msk                        ( 0x3fu << MCAN_HPMS_BIDX_Pos ) /**< \brief (MCAN_HPMS) Buffer Index */
#define MCAN_HPMS_MSI_Pos                         6
#define MCAN_HPMS_MSI_Msk                         ( 0x3u << MCAN_HPMS_MSI_Pos )   /**< \brief (MCAN_HPMS) Message Storage Indicator */
#define   MCAN_HPMS_MSI_NO_FIFO_SEL               ( 0x0u << 6 )                   /**< \brief (MCAN_HPMS) No FIFO selected. */
#define   MCAN_HPMS_MSI_LOST                      ( 0x1u << 6 )                   /**< \brief (MCAN_HPMS) FIFO message. */
#define   MCAN_HPMS_MSI_FIFO_0                    ( 0x2u << 6 )                   /**< \brief (MCAN_HPMS) Message stored in FIFO 0. */
#define   MCAN_HPMS_MSI_FIFO_1                    ( 0x3u << 6 )                   /**< \brief (MCAN_HPMS) Message stored in FIFO 1. */
#define MCAN_HPMS_FIDX_Pos                        8
#define MCAN_HPMS_FIDX_Msk                        ( 0x7fu << MCAN_HPMS_FIDX_Pos ) /**< \brief (MCAN_HPMS) Filter Index */
#define MCAN_HPMS_FLST                            ( 0x1u << 15 )                  /**< \brief (MCAN_HPMS) Filter List */
/* -------- MCAN_NDAT1 : (MCAN Offset: 0x98) New Data 1 Register -------- */
#define MCAN_NDAT1_ND0                            ( 0x1u << 0 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND1                            ( 0x1u << 1 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND2                            ( 0x1u << 2 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND3                            ( 0x1u << 3 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND4                            ( 0x1u << 4 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND5                            ( 0x1u << 5 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND6                            ( 0x1u << 6 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND7                            ( 0x1u << 7 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND8                            ( 0x1u << 8 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND9                            ( 0x1u << 9 )                   /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND10                           ( 0x1u << 10 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND11                           ( 0x1u << 11 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND12                           ( 0x1u << 12 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND13                           ( 0x1u << 13 )                  /**< \brief (MCAN_NDAT1) New Data */
