FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_mcan.h
#define MCAN_NDAT1_ND14                           ( 0x1u << 14 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND15                           ( 0x1u << 15 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND16                           ( 0x1u << 16 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND17                           ( 0x1u << 17 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND18                           ( 0x1u << 18 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND19                           ( 0x1u << 19 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND20                           ( 0x1u << 20 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND21                           ( 0x1u << 21 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND22                           ( 0x1u << 22 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND23                           ( 0x1u << 23 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND24                           ( 0x1u << 24 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND25                           ( 0x1u << 25 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND26                           ( 0x1u << 26 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND27                           ( 0x1u << 27 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND28                           ( 0x1u << 28 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND29                           ( 0x1u << 29 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND30                           ( 0x1u << 30 )                  /**< \brief (MCAN_NDAT1) New Data */
#define MCAN_NDAT1_ND31                           ( 0x1u << 31 )                  /**< \brief (MCAN_NDAT1) New Data */
/* -------- MCAN_NDAT2 : (MCAN Offset: 0x9C) New Data 2 Register -------- */
#define MCAN_NDAT2_ND32                           ( 0x1u << 0 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND33                           ( 0x1u << 1 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND34                           ( 0x1u << 2 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND35                           ( 0x1u << 3 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND36                           ( 0x1u << 4 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND37                           ( 0x1u << 5 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND38                           ( 0x1u << 6 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND39                           ( 0x1u << 7 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND40                           ( 0x1u << 8 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND41                           ( 0x1u << 9 )                   /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND42                           ( 0x1u << 10 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND43                           ( 0x1u << 11 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND44                           ( 0x1u << 12 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND45                           ( 0x1u << 13 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND46                           ( 0x1u << 14 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND47                           ( 0x1u << 15 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND48                           ( 0x1u << 16 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND49                           ( 0x1u << 17 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND50                           ( 0x1u << 18 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND51                           ( 0x1u << 19 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND52                           ( 0x1u << 20 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND53                           ( 0x1u << 21 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND54                           ( 0x1u << 22 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND55                           ( 0x1u << 23 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND56                           ( 0x1u << 24 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND57                           ( 0x1u << 25 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND58                           ( 0x1u << 26 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND59                           ( 0x1u << 27 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND60                           ( 0x1u << 28 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND61                           ( 0x1u << 29 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND62                           ( 0x1u << 30 )                  /**< \brief (MCAN_NDAT2) New Data */
#define MCAN_NDAT2_ND63                           ( 0x1u << 31 )                  /**< \brief (MCAN_NDAT2) New Data */
/* -------- MCAN_RXF0C : (MCAN Offset: 0xA0) Receive FIFO 0 Configuration Register -------- */
#define MCAN_RXF0C_F0SA_Pos                       2
#define MCAN_RXF0C_F0SA_Msk                       ( 0x3fffu << MCAN_RXF0C_F0SA_Pos ) /**< \brief (MCAN_RXF0C) Receive FIFO 0 Start Address */
#define MCAN_RXF0C_F0SA( value )    ( ( MCAN_RXF0C_F0SA_Msk & ( ( value ) << MCAN_RXF0C_F0SA_Pos ) ) )
#define MCAN_RXF0C_F0S_Pos                        16
#define MCAN_RXF0C_F0S_Msk                        ( 0x7fu << MCAN_RXF0C_F0S_Pos ) /**< \brief (MCAN_RXF0C) Receive FIFO 0 Start Address */
#define MCAN_RXF0C_F0S( value )     ( ( MCAN_RXF0C_F0S_Msk & ( ( value ) << MCAN_RXF0C_F0S_Pos ) ) )
#define MCAN_RXF0C_F0WM_Pos                       24
#define MCAN_RXF0C_F0WM_Msk                       ( 0x7fu << MCAN_RXF0C_F0WM_Pos ) /**< \brief (MCAN_RXF0C) Receive FIFO 0 Watermark */
#define MCAN_RXF0C_F0WM( value )    ( ( MCAN_RXF0C_F0WM_Msk & ( ( value ) << MCAN_RXF0C_F0WM_Pos ) ) )
#define MCAN_RXF0C_F0OM                           ( 0x1u << 31 )                   /**< \brief (MCAN_RXF0C) FIFO 0 Operation Mode */
/* -------- MCAN_RXF0S : (MCAN Offset: 0xA4) Receive FIFO 0 Status Register -------- */
#define MCAN_RXF0S_F0FL_Pos                       0
#define MCAN_RXF0S_F0FL_Msk                       ( 0x7fu << MCAN_RXF0S_F0FL_Pos ) /**< \brief (MCAN_RXF0S) Receive FIFO 0 Fill Level */
#define MCAN_RXF0S_F0GI_Pos                       8
#define MCAN_RXF0S_F0GI_Msk                       ( 0x3fu << MCAN_RXF0S_F0GI_Pos ) /**< \brief (MCAN_RXF0S) Receive FIFO 0 Get Index */
#define MCAN_RXF0S_F0PI_Pos                       16
#define MCAN_RXF0S_F0PI_Msk                       ( 0x3fu << MCAN_RXF0S_F0PI_Pos ) /**< \brief (MCAN_RXF0S) Receive FIFO 0 Put Index */
#define MCAN_RXF0S_F0F                            ( 0x1u << 24 )                   /**< \brief (MCAN_RXF0S) Receive FIFO 0 Fill Level */
#define MCAN_RXF0S_RF0L                           ( 0x1u << 25 )                   /**< \brief (MCAN_RXF0S) Receive FIFO 0 Message Lost */
/* -------- MCAN_RXF0A : (MCAN Offset: 0xA8) Receive FIFO 0 Acknowledge Register -------- */
#define MCAN_RXF0A_F0AI_Pos                       0
#define MCAN_RXF0A_F0AI_Msk                       ( 0x3fu << MCAN_RXF0A_F0AI_Pos ) /**< \brief (MCAN_RXF0A) Receive FIFO 0 Acknowledge Index */
#define MCAN_RXF0A_F0AI( value )    ( ( MCAN_RXF0A_F0AI_Msk & ( ( value ) << MCAN_RXF0A_F0AI_Pos ) ) )
/* -------- MCAN_RXBC : (MCAN Offset: 0xAC) Receive Rx Buffer Configuration Register -------- */
#define MCAN_RXBC_RBSA_Pos                        2
#define MCAN_RXBC_RBSA_Msk                        ( 0x3fffu << MCAN_RXBC_RBSA_Pos ) /**< \brief (MCAN_RXBC) Receive Buffer Start Address */
#define MCAN_RXBC_RBSA( value )    ( ( MCAN_RXBC_RBSA_Msk & ( ( value ) << MCAN_RXBC_RBSA_Pos ) ) )
/* -------- MCAN_RXF1C : (MCAN Offset: 0xB0) Receive FIFO 1 Configuration Register -------- */
#define MCAN_RXF1C_F1SA_Pos                       2
#define MCAN_RXF1C_F1SA_Msk                       ( 0x3fffu << MCAN_RXF1C_F1SA_Pos ) /**< \brief (MCAN_RXF1C) Receive FIFO 1 Start Address */
#define MCAN_RXF1C_F1SA( value )    ( ( MCAN_RXF1C_F1SA_Msk & ( ( value ) << MCAN_RXF1C_F1SA_Pos ) ) )
#define MCAN_RXF1C_F1S_Pos                        16
#define MCAN_RXF1C_F1S_Msk                        ( 0x7fu << MCAN_RXF1C_F1S_Pos ) /**< \brief (MCAN_RXF1C) Receive FIFO 1 Start Address */
#define MCAN_RXF1C_F1S( value )     ( ( MCAN_RXF1C_F1S_Msk & ( ( value ) << MCAN_RXF1C_F1S_Pos ) ) )
#define MCAN_RXF1C_F1WM_Pos                       24
#define MCAN_RXF1C_F1WM_Msk                       ( 0x7fu << MCAN_RXF1C_F1WM_Pos ) /**< \brief (MCAN_RXF1C) Receive FIFO 1 Watermark */
#define MCAN_RXF1C_F1WM( value )    ( ( MCAN_RXF1C_F1WM_Msk & ( ( value ) << MCAN_RXF1C_F1WM_Pos ) ) )
#define MCAN_RXF1C_F1OM                           ( 0x1u << 31 )                   /**< \brief (MCAN_RXF1C) FIFO 1 Operation Mode */
/* -------- MCAN_RXF1S : (MCAN Offset: 0xB4) Receive FIFO 1 Status Register -------- */
#define MCAN_RXF1S_F1FL_Pos                       0
#define MCAN_RXF1S_F1FL_Msk                       ( 0x7fu << MCAN_RXF1S_F1FL_Pos ) /**< \brief (MCAN_RXF1S) Receive FIFO 1 Fill Level */
#define MCAN_RXF1S_F1GI_Pos                       8
#define MCAN_RXF1S_F1GI_Msk                       ( 0x3fu << MCAN_RXF1S_F1GI_Pos ) /**< \brief (MCAN_RXF1S) Receive FIFO 1 Get Index */
#define MCAN_RXF1S_F1PI_Pos                       16
#define MCAN_RXF1S_F1PI_Msk                       ( 0x3fu << MCAN_RXF1S_F1PI_Pos ) /**< \brief (MCAN_RXF1S) Receive FIFO 1 Put Index */
#define MCAN_RXF1S_F1F                            ( 0x1u << 24 )                   /**< \brief (MCAN_RXF1S) Receive FIFO 1 Fill Level */
#define MCAN_RXF1S_RF1L                           ( 0x1u << 25 )                   /**< \brief (MCAN_RXF1S) Receive FIFO 1 Message Lost */
#define MCAN_RXF1S_DMS_Pos                        30
#define MCAN_RXF1S_DMS_Msk                        ( 0x3u << MCAN_RXF1S_DMS_Pos )   /**< \brief (MCAN_RXF1S) Debug Message Status */
#define   MCAN_RXF1S_DMS_IDLE                     ( 0x0u << 30 )                   /**< \brief (MCAN_RXF1S) Idle state, wait for reception of debug messages, DMA request is cleared. */
#define   MCAN_RXF1S_DMS_MSG_A                    ( 0x1u << 30 )                   /**< \brief (MCAN_RXF1S) Debug message A received. */
#define   MCAN_RXF1S_DMS_MSG_AB                   ( 0x2u << 30 )                   /**< \brief (MCAN_RXF1S) Debug messages A, B received. */
#define   MCAN_RXF1S_DMS_MSG_ABC                  ( 0x3u << 30 )                   /**< \brief (MCAN_RXF1S) Debug messages A, B, C received, DMA request is set. */
/* -------- MCAN_RXF1A : (MCAN Offset: 0xB8) Receive FIFO 1 Acknowledge Register -------- */
#define MCAN_RXF1A_F1AI_Pos                       0
#define MCAN_RXF1A_F1AI_Msk                       ( 0x3fu << MCAN_RXF1A_F1AI_Pos ) /**< \brief (MCAN_RXF1A) Receive FIFO 1 Acknowledge Index */
#define MCAN_RXF1A_F1AI( value )    ( ( MCAN_RXF1A_F1AI_Msk & ( ( value ) << MCAN_RXF1A_F1AI_Pos ) ) )
/* -------- MCAN_RXESC : (MCAN Offset: 0xBC) Receive Buffer / FIFO Element Size Configuration Register -------- */
#define MCAN_RXESC_F0DS_Pos                       0
#define MCAN_RXESC_F0DS_Msk                       ( 0x7u << MCAN_RXESC_F0DS_Pos ) /**< \brief (MCAN_RXESC) Receive FIFO 0 Data Field Size */
#define MCAN_RXESC_F0DS( value )    ( ( MCAN_RXESC_F0DS_Msk & ( ( value ) << MCAN_RXESC_F0DS_Pos ) ) )
#define   MCAN_RXESC_F0DS_8_BYTE                  ( 0x0u << 0 )                   /**< \brief (MCAN_RXESC) 8 byte data field */
#define   MCAN_RXESC_F0DS_12_BYTE                 ( 0x1u << 0 )                   /**< \brief (MCAN_RXESC) 12 byte data field */
#define   MCAN_RXESC_F0DS_16_BYTE                 ( 0x2u << 0 )                   /**< \brief (MCAN_RXESC) 16 byte data field */
#define   MCAN_RXESC_F0DS_20_BYTE                 ( 0x3u << 0 )                   /**< \brief (MCAN_RXESC) 20 byte data field */
#define   MCAN_RXESC_F0DS_24_BYTE                 ( 0x4u << 0 )                   /**< \brief (MCAN_RXESC) 24 byte data field */
#define   MCAN_RXESC_F0DS_32_BYTE                 ( 0x5u << 0 )                   /**< \brief (MCAN_RXESC) 32 byte data field */
#define   MCAN_RXESC_F0DS_48_BYTE                 ( 0x6u << 0 )                   /**< \brief (MCAN_RXESC) 48 byte data field */
#define   MCAN_RXESC_F0DS_64_BYTE                 ( 0x7u << 0 )                   /**< \brief (MCAN_RXESC) 64 byte data field */
#define MCAN_RXESC_F1DS_Pos                       4
#define MCAN_RXESC_F1DS_Msk                       ( 0x7u << MCAN_RXESC_F1DS_Pos ) /**< \brief (MCAN_RXESC) Receive FIFO 1 Data Field Size */
#define MCAN_RXESC_F1DS( value )    ( ( MCAN_RXESC_F1DS_Msk & ( ( value ) << MCAN_RXESC_F1DS_Pos ) ) )
#define   MCAN_RXESC_F1DS_8_BYTE                  ( 0x0u << 4 )                   /**< \brief (MCAN_RXESC) 8 byte data field */
#define   MCAN_RXESC_F1DS_12_BYTE                 ( 0x1u << 4 )                   /**< \brief (MCAN_RXESC) 12 byte data field */
#define   MCAN_RXESC_F1DS_16_BYTE                 ( 0x2u << 4 )                   /**< \brief (MCAN_RXESC) 16 byte data field */
#define   MCAN_RXESC_F1DS_20_BYTE                 ( 0x3u << 4 )                   /**< \brief (MCAN_RXESC) 20 byte data field */
#define   MCAN_RXESC_F1DS_24_BYTE                 ( 0x4u << 4 )                   /**< \brief (MCAN_RXESC) 24 byte data field */
#define   MCAN_RXESC_F1DS_32_BYTE                 ( 0x5u << 4 )                   /**< \brief (MCAN_RXESC) 32 byte data field */
#define   MCAN_RXESC_F1DS_48_BYTE                 ( 0x6u << 4 )                   /**< \brief (MCAN_RXESC) 48 byte data field */
#define   MCAN_RXESC_F1DS_64_BYTE                 ( 0x7u << 4 )                   /**< \brief (MCAN_RXESC) 64 byte data field */
#define MCAN_RXESC_RBDS_Pos                       8
#define MCAN_RXESC_RBDS_Msk                       ( 0x7u << MCAN_RXESC_RBDS_Pos ) /**< \brief (MCAN_RXESC) Receive Buffer Data Field Size */
#define MCAN_RXESC_RBDS( value )    ( ( MCAN_RXESC_RBDS_Msk & ( ( value ) << MCAN_RXESC_RBDS_Pos ) ) )
#define   MCAN_RXESC_RBDS_8_BYTE                  ( 0x0u << 8 )                   /**< \brief (MCAN_RXESC) 8 byte data field */
#define   MCAN_RXESC_RBDS_12_BYTE                 ( 0x1u << 8 )                   /**< \brief (MCAN_RXESC) 12 byte data field */
#define   MCAN_RXESC_RBDS_16_BYTE                 ( 0x2u << 8 )                   /**< \brief (MCAN_RXESC) 16 byte data field */
#define   MCAN_RXESC_RBDS_20_BYTE                 ( 0x3u << 8 )                   /**< \brief (MCAN_RXESC) 20 byte data field */
#define   MCAN_RXESC_RBDS_24_BYTE                 ( 0x4u << 8 )                   /**< \brief (MCAN_RXESC) 24 byte data field */
#define   MCAN_RXESC_RBDS_32_BYTE                 ( 0x5u << 8 )                   /**< \brief (MCAN_RXESC) 32 byte data field */
#define   MCAN_RXESC_RBDS_48_BYTE                 ( 0x6u << 8 )                   /**< \brief (MCAN_RXESC) 48 byte data field */
#define   MCAN_RXESC_RBDS_64_BYTE                 ( 0x7u << 8 )                   /**< \brief (MCAN_RXESC) 64 byte data field */
/* -------- MCAN_TXBC : (MCAN Offset: 0xC0) Transmit Buffer Configuration Register -------- */
#define MCAN_TXBC_TBSA_Pos                        2
#define MCAN_TXBC_TBSA_Msk                        ( 0x3fffu << MCAN_TXBC_TBSA_Pos ) /**< \brief (MCAN_TXBC) Tx Buffers Start Address */
#define MCAN_TXBC_TBSA( value )    ( ( MCAN_TXBC_TBSA_Msk & ( ( value ) << MCAN_TXBC_TBSA_Pos ) ) )
#define MCAN_TXBC_NDTB_Pos                        16
#define MCAN_TXBC_NDTB_Msk                        ( 0x3fu << MCAN_TXBC_NDTB_Pos ) /**< \brief (MCAN_TXBC) Number of Dedicated Transmit Buffers */
#define MCAN_TXBC_NDTB( value )    ( ( MCAN_TXBC_NDTB_Msk & ( ( value ) << MCAN_TXBC_NDTB_Pos ) ) )
#define MCAN_TXBC_TFQS_Pos                        24
#define MCAN_TXBC_TFQS_Msk                        ( 0x3fu << MCAN_TXBC_TFQS_Pos ) /**< \brief (MCAN_TXBC) Transmit FIFO/Queue Size */
#define MCAN_TXBC_TFQS( value )    ( ( MCAN_TXBC_TFQS_Msk & ( ( value ) << MCAN_TXBC_TFQS_Pos ) ) )
#define MCAN_TXBC_TFQM                            ( 0x1u << 30 )                  /**< \brief (MCAN_TXBC) Tx FIFO/Queue Mode */
/* -------- MCAN_TXFQS : (MCAN Offset: 0xC4) Transmit FIFO/Queue Status Register -------- */
#define MCAN_TXFQS_TFFL_Pos                       0
#define MCAN_TXFQS_TFFL_Msk                       ( 0x3fu << MCAN_TXFQS_TFFL_Pos )  /**< \brief (MCAN_TXFQS) Tx FIFO Free Level */
#define MCAN_TXFQS_TFGI_Pos                       8
#define MCAN_TXFQS_TFGI_Msk                       ( 0x1fu << MCAN_TXFQS_TFGI_Pos )  /**< \brief (MCAN_TXFQS) Tx FIFO Get Index */
#define MCAN_TXFQS_TFQPI_Pos                      16
#define MCAN_TXFQS_TFQPI_Msk                      ( 0x1fu << MCAN_TXFQS_TFQPI_Pos ) /**< \brief (MCAN_TXFQS) Tx FIFO/Queue Put Index */
#define MCAN_TXFQS_TFQF                           ( 0x1u << 21 )                    /**< \brief (MCAN_TXFQS) Tx FIFO/Queue Full */
/* -------- MCAN_TXESC : (MCAN Offset: 0xC8) Transmit Buffer Element Size Configuration Register -------- */
#define MCAN_TXESC_TBDS_Pos                       0
#define MCAN_TXESC_TBDS_Msk                       ( 0x7u << MCAN_TXESC_TBDS_Pos ) /**< \brief (MCAN_TXESC) Tx Buffer Data Field Size */
#define MCAN_TXESC_TBDS( value )    ( ( MCAN_TXESC_TBDS_Msk & ( ( value ) << MCAN_TXESC_TBDS_Pos ) ) )
#define   MCAN_TXESC_TBDS_8_BYTE                  ( 0x0u << 0 )                   /**< \brief (MCAN_TXESC) 8 byte data field */
#define   MCAN_TXESC_TBDS_12_BYTE                 ( 0x1u << 0 )                   /**< \brief (MCAN_TXESC) 12 byte data field */
#define   MCAN_TXESC_TBDS_16_BYTE                 ( 0x2u << 0 )                   /**< \brief (MCAN_TXESC) 16 byte data field */
#define   MCAN_TXESC_TBDS_20_BYTE                 ( 0x3u << 0 )                   /**< \brief (MCAN_TXESC) 20 byte data field */
#define   MCAN_TXESC_TBDS_24_BYTE                 ( 0x4u << 0 )                   /**< \brief (MCAN_TXESC) 24 byte data field */
#define   MCAN_TXESC_TBDS_32_BYTE                 ( 0x5u << 0 )                   /**< \brief (MCAN_TXESC) 32 byte data field */
#define   MCAN_TXESC_TBDS_48_BYTE                 ( 0x6u << 0 )                   /**< \brief (MCAN_TXESC) 48 byte data field */
#define   MCAN_TXESC_TBDS_64_BYTE                 ( 0x7u << 0 )                   /**< \brief (MCAN_TXESC) 64 byte data field */
/* -------- MCAN_TXBRP : (MCAN Offset: 0xCC) Transmit Buffer Request Pending Register -------- */
#define MCAN_TXBRP_TRP0                           ( 0x1u << 0 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 0 */
#define MCAN_TXBRP_TRP1                           ( 0x1u << 1 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 1 */
#define MCAN_TXBRP_TRP2                           ( 0x1u << 2 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 2 */
#define MCAN_TXBRP_TRP3                           ( 0x1u << 3 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 3 */
#define MCAN_TXBRP_TRP4                           ( 0x1u << 4 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 4 */
#define MCAN_TXBRP_TRP5                           ( 0x1u << 5 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 5 */
#define MCAN_TXBRP_TRP6                           ( 0x1u << 6 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 6 */
#define MCAN_TXBRP_TRP7                           ( 0x1u << 7 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 7 */
#define MCAN_TXBRP_TRP8                           ( 0x1u << 8 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 8 */
#define MCAN_TXBRP_TRP9                           ( 0x1u << 9 )                   /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 9 */
#define MCAN_TXBRP_TRP10                          ( 0x1u << 10 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 10 */
#define MCAN_TXBRP_TRP11                          ( 0x1u << 11 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 11 */
#define MCAN_TXBRP_TRP12                          ( 0x1u << 12 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 12 */
#define MCAN_TXBRP_TRP13                          ( 0x1u << 13 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 13 */
#define MCAN_TXBRP_TRP14                          ( 0x1u << 14 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 14 */
#define MCAN_TXBRP_TRP15                          ( 0x1u << 15 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 15 */
#define MCAN_TXBRP_TRP16                          ( 0x1u << 16 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 16 */
#define MCAN_TXBRP_TRP17                          ( 0x1u << 17 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 17 */
#define MCAN_TXBRP_TRP18                          ( 0x1u << 18 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 18 */
#define MCAN_TXBRP_TRP19                          ( 0x1u << 19 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 19 */
#define MCAN_TXBRP_TRP20                          ( 0x1u << 20 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 20 */
#define MCAN_TXBRP_TRP21                          ( 0x1u << 21 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 21 */
#define MCAN_TXBRP_TRP22                          ( 0x1u << 22 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 22 */
#define MCAN_TXBRP_TRP23                          ( 0x1u << 23 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 23 */
#define MCAN_TXBRP_TRP24                          ( 0x1u << 24 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 24 */
#define MCAN_TXBRP_TRP25                          ( 0x1u << 25 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 25 */
#define MCAN_TXBRP_TRP26                          ( 0x1u << 26 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 26 */
#define MCAN_TXBRP_TRP27                          ( 0x1u << 27 )                  /**< \brief (MCAN_TXBRP) Transmission Request Pending for Buffer 27 */
